# Задача
# Сделайте функцию, которая параметром будет принимать букву и проверять
# , это буква кириллицы или латиницы.




input_alpha = input("Введите букву :    ")
def check(input_alpha):
    cyr_alphabet = ["а","б","в","г","д","е","ё","ж","з","и","й","к","л","м","н","о", "п","р","с","т","у","ф","х","ц","ч","ш","щ","ъ","ы","ь","э","ю","я"]
    for i in input_alpha:
        if i in cyr_alphabet:
            print("Это кирилица")
        else:
            print("Это латиница")
print(check(input_alpha))


